CRUD
----

- C --> create

- R --> read/fetch/get

- U --> update/modify/alter

- D --> delete / drop

In [2]:
import numpy as np
import pandas as pd

C --> create
---

In [237]:
data = {
    'names' : ['Ramesh','Suresh','Satish','Alex','John'],
    'age' : [21,22,23,24,25],
    'id' : [101,102,103,104,105],
    'address' : ['aaa','bbb','ccc','ddd','eee']
    }

In [238]:
df = pd.DataFrame(data)

In [239]:
df

    names  age   id address
0  Ramesh   21  101     aaa
1  Suresh   22  102     bbb
2  Satish   23  103     ccc
3    Alex   24  104     ddd
4    John   25  105     eee

In [240]:
print(df.to_string(index=False)) # to remove index column

 names  age  id address
Ramesh   21 101     aaa
Suresh   22 102     bbb
Satish   23 103     ccc
  Alex   24 104     ddd
  John   25 105     eee

R --> read/fetch/get
---

In [242]:
df.head(3)

    names  age   id address
0  Ramesh   21  101     aaa
1  Suresh   22  102     bbb
2  Satish   23  103     ccc

In [243]:
df.head(-2)

    names  age   id address
0  Ramesh   21  101     aaa
1  Suresh   22  102     bbb
2  Satish   23  103     ccc

In [244]:
df.tail(3)

    names  age   id address
2  Satish   23  103     ccc
3    Alex   24  104     ddd
4    John   25  105     eee

In [245]:
df.tail(-2)

    names  age   id address
2  Satish   23  103     ccc
3    Alex   24  104     ddd
4    John   25  105     eee

In [246]:
df['address']  # read single column name

0    aaa
1    bbb
2    ccc
3    ddd
4    eee
Name: address, dtype: object

In [247]:
df[['names','address']] # multi index or fancy index

    names address
0  Ramesh     aaa
1  Suresh     bbb
2  Satish     ccc
3    Alex     ddd
4    John     eee

In [248]:
df[['names','age','address']]

    names  age address
0  Ramesh   21     aaa
1  Suresh   22     bbb
2  Satish   23     ccc
3    Alex   24     ddd
4    John   25     eee

In [249]:
df.loc['names':'address']
# in loc, both start and stop are included

Empty DataFrame
Columns: [names, age, id, address]
Index: []

In [250]:
df.loc[:,'names':'address']

    names  age   id address
0  Ramesh   21  101     aaa
1  Suresh   22  102     bbb
2  Satish   23  103     ccc
3    Alex   24  104     ddd
4    John   25  105     eee

In [251]:
df.iloc[:,0:3]
# in iloc, start included and stop excluded

    names  age   id
0  Ramesh   21  101
1  Suresh   22  102
2  Satish   23  103
3    Alex   24  104
4    John   25  105

In [252]:
df.iloc[:,0:4]

    names  age   id address
0  Ramesh   21  101     aaa
1  Suresh   22  102     bbb
2  Satish   23  103     ccc
3    Alex   24  104     ddd
4    John   25  105     eee

In [253]:
df.iloc[:,:]

    names  age   id address
0  Ramesh   21  101     aaa
1  Suresh   22  102     bbb
2  Satish   23  103     ccc
3    Alex   24  104     ddd
4    John   25  105     eee

In [254]:
df

    names  age   id address
0  Ramesh   21  101     aaa
1  Suresh   22  102     bbb
2  Satish   23  103     ccc
3    Alex   24  104     ddd
4    John   25  105     eee

In [255]:
df.iloc[[0,2,3],::2]

    names   id
0  Ramesh  101
2  Satish  103
3    Alex  104

In [256]:
df.loc[[0,2,3],['names','id']] # return unordered rows and unordered columns

    names   id
0  Ramesh  101
2  Satish  103
3    Alex  104

In [257]:
df.iloc[2,:]

names      Satish
age            23
id            103
address       ccc
Name: 2, dtype: object

In [258]:
mask = df['age'] > 23 # boolean mask
df[mask]

  names  age   id address
3  Alex   24  104     ddd
4  John   25  105     eee

In [259]:
mask = (df['id'] > 103) & (df['age'] > 23) # return age > 23 and id > 103
df[mask]

  names  age   id address
3  Alex   24  104     ddd
4  John   25  105     eee

U --> update/alter/modify
---

In [261]:
df

    names  age   id address
0  Ramesh   21  101     aaa
1  Suresh   22  102     bbb
2  Satish   23  103     ccc
3    Alex   24  104     ddd
4    John   25  105     eee

In [262]:
df.rename(columns={'id':'ID','names':'Names'}) # rename the column name

    Names  age   ID address
0  Ramesh   21  101     aaa
1  Suresh   22  102     bbb
2  Satish   23  103     ccc
3    Alex   24  104     ddd
4    John   25  105     eee

In [263]:
df = df.rename(columns={'id':'ID','names':'Names','age':'Age','address':'Address'})
# columns = {<old_name> : <new_name> }

In [264]:
df

    Names  Age   ID Address
0  Ramesh   21  101     aaa
1  Suresh   22  102     bbb
2  Satish   23  103     ccc
3    Alex   24  104     ddd
4    John   25  105     eee

In [265]:
df.set_index(keys='ID',inplace=True)
# inplace = True means what we changes it directly modify in the original dataframe

In [266]:
df

      Names  Age Address
ID
101  Ramesh   21     aaa
102  Suresh   22     bbb
103  Satish   23     ccc
104    Alex   24     ddd
105    John   25     eee

In [267]:
df.rename(index={103:100}) # rename of index values

      Names  Age Address
ID
101  Ramesh   21     aaa
102  Suresh   22     bbb
100  Satish   23     ccc
104    Alex   24     ddd
105    John   25     eee

In [268]:
df

      Names  Age Address
ID
101  Ramesh   21     aaa
102  Suresh   22     bbb
103  Satish   23     ccc
104    Alex   24     ddd
105    John   25     eee

In [269]:
df['Phone'] = [123,456,789,112,113]
df

      Names  Age Address  Phone
ID
101  Ramesh   21     aaa    123
102  Suresh   22     bbb    456
103  Satish   23     ccc    789
104    Alex   24     ddd    112
105    John   25     eee    113

In [270]:
df.loc[105]

Names      John
Age          25
Address     eee
Phone       113
Name: 105, dtype: object

In [271]:
df.loc[106]=['Charlie',26,'fff',321]
df

       Names  Age Address  Phone
ID
101   Ramesh   21     aaa    123
102   Suresh   22     bbb    456
103   Satish   23     ccc    789
104     Alex   24     ddd    112
105     John   25     eee    113
106  Charlie   26     fff    321

In [272]:
df.loc[106]

Names      Charlie
Age             26
Address        fff
Phone          321
Name: 106, dtype: object

In [273]:
df.loc[103,'Names']='Goku'
df

       Names  Age Address  Phone
ID
101   Ramesh   21     aaa    123
102   Suresh   22     bbb    456
103     Goku   23     ccc    789
104     Alex   24     ddd    112
105     John   25     eee    113
106  Charlie   26     fff    321

In [324]:
df.loc[102]=['Ram',27,'hhh',654]
df

       Names  Age Address  Phone
ID
101   Ramesh   21     aaa    123
102      Ram   27     hhh    654
103     Goku   23     ccc    789
104     Alex   24     ddd    112
105     John   25     eee    113
106  Charlie   26     fff    321

In [328]:
df[df['Age']>25]

       Names  Age Address  Phone
ID
102      Ram   27     hhh    654
106  Charlie   26     fff    321

In [336]:
mask = df['Age']>=25
df[mask]

       Names  Age Address  Phone
ID
102      Ram   27     hhh    654
105     John   25     eee    113
106  Charlie   26     fff    321

In [338]:
dff = df[mask]
dff['Age']

ID
102    27
105    25
106    26
Name: Age, dtype: int64

In [340]:
dff['Age']=30
dff

/var/folders/47/w_25m_7s321dp7p21gqngcl40000gn/T/ipykernel_55623/2803905092.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  dff['Age']=30

       Names  Age Address  Phone
ID
102      Ram   30     hhh    654
105     John   30     eee    113
106  Charlie   30     fff    321

In [342]:
dff

       Names  Age Address  Phone
ID
102      Ram   30     hhh    654
105     John   30     eee    113
106  Charlie   30     fff    321

In [344]:
df

       Names  Age Address  Phone
ID
101   Ramesh   21     aaa    123
102      Ram   27     hhh    654
103     Goku   23     ccc    789
104     Alex   24     ddd    112
105     John   25     eee    113
106  Charlie   26     fff    321

D --> delete / drop
----

In [349]:
df

       Names  Age Address  Phone
ID
101   Ramesh   21     aaa    123
102      Ram   27     hhh    654
103     Goku   23     ccc    789
104     Alex   24     ddd    112
105     John   25     eee    113
106  Charlie   26     fff    321

In [351]:
del df['Address'] # delete specific column

In [353]:
df

       Names  Age  Phone
ID
101   Ramesh   21    123
102      Ram   27    654
103     Goku   23    789
104     Alex   24    112
105     John   25    113
106  Charlie   26    321

In [361]:
df.drop('Age',axis=1)

       Names  Phone
ID
101   Ramesh    123
102      Ram    654
103     Goku    789
104     Alex    112
105     John    113
106  Charlie    321

In [363]:
df

       Names  Age  Phone
ID
101   Ramesh   21    123
102      Ram   27    654
103     Goku   23    789
104     Alex   24    112
105     John   25    113
106  Charlie   26    321

In [365]:
df.drop('Age',axis=1,inplace=True)

In [367]:
df

       Names  Phone
ID
101   Ramesh    123
102      Ram    654
103     Goku    789
104     Alex    112
105     John    113
106  Charlie    321

In [373]:
df.drop(columns=['Names','Phone'],axis=1)

Empty DataFrame
Columns: []
Index: [101, 102, 103, 104, 105, 106]

In [375]:
df

       Names  Phone
ID
101   Ramesh    123
102      Ram    654
103     Goku    789
104     Alex    112
105     John    113
106  Charlie    321

In [383]:
df.reset_index(drop=True,inplace=True)

In [385]:
df

     Names  Phone
0   Ramesh    123
1      Ram    654
2     Goku    789
3     Alex    112
4     John    113
5  Charlie    321

In [391]:
df.drop('Phone',axis=1,inplace=True)

In [393]:
df

     Names
0   Ramesh
1      Ram
2     Goku
3     Alex
4     John
5  Charlie

In [395]:
df.drop('Names',axis=1,inplace=True)
df

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5]

In [399]:
df.reset_index(drop=True,inplace=True)

In [401]:
df

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5]

In [403]:
df.reset_index(drop=True, inplace=True)

In [407]:
df.columns

Index([], dtype='object')